{"keras_version": "2.2.4", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "batch_input_shape": [null, 1, 40, 40], "dtype": "float32", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "strides": [2, 2], "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_2", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_2", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_3", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "strides": [2, 2], "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_3", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_4", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "trainable": true, "strides": [1, 1], "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "conv2d_4", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_5", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 256, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "trainable": true, "epsilon": 0.001, "gamma_constraint": null, "name": "batch_normalization_6", "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"units": 36, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}]}, "backend": "tensorflow"}